export const Book = () => {
  return (
    <div style={{marginRight: "7px"}}>
      <svg
        className="svgicon css48"
        preserveAspectRatio="xMidYMid meet"
        xmlns="http://www.w3.org/2000/svg"
        viewBox="-0.5 0 19 19"
        style={{ marginTop: "3px", borderRadius: "0%",width: "20px", height: "100%", fill: "white"}}
      >
        <rect
          x="-0.5"
          y={0}
          width={19}
          height={19}
          style={{ fill: "none" }}
          rx={0}
          ry={0}
        />
        <g transform="scale(1) translate(0, 0)" transform-origin="-0.5 0">
          <defs />
          <title>book</title>
          <g id="Слой_2" data-name="Слой 2">
            <g id="Icons">
              <path
                id="Book"
                className="cls-1"
                d="M9.17,19.18a1.88,1.88,0,0,1-1-.32,9.22,9.22,0,0,0-6.92-1.37,1,1,0,0,1-1.21-1V1A1,1,0,0,1,1,0H3.82A10.65,10.65,0,0,1,6.34.3,1,1,0,1,1,5.8,2.23,8.77,8.77,0,0,0,3.57,2H2V15.36a11.18,11.18,0,0,1,7.17,1.8,11.18,11.18,0,0,1,7.17-1.8V2.05a9.2,9.2,0,0,0-6.12,1.49l0,9.7a1,1,0,1,1-2,0V3.07a1,1,0,0,1,.39-.8,11.23,11.23,0,0,1,9-2,1,1,0,0,1,.78,1V16.51a1,1,0,0,1-1.21,1,9.22,9.22,0,0,0-6.92,1.37A1.88,1.88,0,0,1,9.17,19.18Z"
              />
            </g>
          </g>
        </g>
      </svg>
    </div>
  );
};
export const Search = () => {
    return <svg
    xmlns="http://www.w3.org/2000/svg"
    x="0px"
    y="0px"
    width={20}
    height={20}
    viewBox="0 0 50 50"
    fill="white"
  >
    <path d="M 21 3 C 11.601563 3 4 10.601563 4 20 C 4 29.398438 11.601563 37 21 37 C 24.355469 37 27.460938 36.015625 30.09375 34.34375 L 42.375 46.625 L 46.625 42.375 L 34.5 30.28125 C 36.679688 27.421875 38 23.878906 38 20 C 38 10.601563 30.398438 3 21 3 Z M 21 7 C 28.199219 7 34 12.800781 34 20 C 34 27.199219 28.199219 33 21 33 C 13.800781 33 8 27.199219 8 20 C 8 12.800781 13.800781 7 21 7 Z" />
  </svg>
  
  
  
}
export const Cart = () => {
    return <svg
    viewBox="0 0 12 12"
    enableBackground="new 0 0 12 12"
    id="Слой_1"
    version="1.1"
    width={20}
    height={20}
    xmlSpace="preserve"
    xmlns="http://www.w3.org/2000/svg"
    xmlnsXlink="http://www.w3.org/1999/xlink"
    fill="#000000"
  >
    <g id="SVGRepo_bgCarrier" strokeWidth={0} />
    <g id="SVGRepo_tracerCarrier" strokeLinecap="round" strokeLinejoin="round" />
    <g id="SVGRepo_iconCarrier">
      <path
        d="M11.5,8L12,3L2.1803589,2.0935669L1.9477539,0H0v1h1.0522461L1.953064,9.1067505 C1.3963623,9.3261108,1,9.866272,1,10.5C1,11.3271484,1.6728516,12,2.5,12S4,11.3271484,4,10.5 c0-0.1761475-0.0360718-0.3428345-0.0921021-0.5h4.1842041C8.0360718,10.1571655,8,10.3238525,8,10.5 C8,11.3271484,8.6728516,12,9.5,12s1.5-0.6728516,1.5-1.5S10.3271484,9,9.5,9H2.9476318l-0.111145-1H11.5z M2.5,11 C2.2241211,11,2,10.7758789,2,10.5c0-0.2634277,0.2062378-0.473938,0.4649048-0.4929199l0.0452881-0.0050049 C2.7811279,10.0078125,3,10.2277222,3,10.5C3,10.7758789,2.7758789,11,2.5,11z M10,10.5c0,0.2758789-0.2241211,0.5-0.5,0.5 S9,10.7758789,9,10.5S9.2241211,10,9.5,10S10,10.2241211,10,10.5z"
        fill="#1D1D1B"
      />
    </g>
  </svg>
  
}
export const Cross = () => {
  return (
      <svg
          xmlns="http://www.w3.org/2000/svg"
          width={15}
          height={15}
          viewBox="0 0 24 24"
      >
        <path d="M24 20.188l-8.315-8.209 8.2-8.282-3.697-3.697-8.212 8.318-8.31-8.203-3.666 3.666 8.321 8.24-8.206 8.313 3.666 3.666 8.237-8.318 8.285 8.203z" />
      </svg>


  )
}
